backend: "python"

parameters: {
  key: "huggingface_model",
  value: {string_value: "microsoft/Phi-3-mini-4k-instruct"}
}
parameters: {
  key: "max_output_length",
  value: {string_value: "256"}
}

input [
  {
    name: "text_input"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "text_output"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
